In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(data=[10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s2 = pd.Series(data=[100, 200, 300, 400, 500])
s2

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [4]:
s3 = pd.Series(data=[1000, 2000, 3000, 4000, 5000], index=list("vwxyz"))
s3

v    1000
w    2000
x    3000
y    4000
z    5000
dtype: int64

In [5]:
df = pd.DataFrame({"C1": s1, "C2": s2})
df

   C1   C2
0  10  100
1  20  200
2  30  300
3  40  400
4  50  500

In [6]:
df = pd.DataFrame(data=np.random.randint(1, 100, size=(1000, 5)), columns=list("abcde"))
df

      a   b   c   d   e
0    89  60  66  15  79
1    94  51  91  46  23
2     4  71  16   3   5
3    18  61  68  97   7
4    27  70  61  76  90
..   ..  ..  ..  ..  ..
995  13  11  69  57  74
996  15  64   8  75  20
997  54   7  76  66  47
998  94  66  54  44  98
999  41  62  29  12  33

[1000 rows x 5 columns]

In [8]:
dataset = pd.read_csv("E:\Data Science\session4\session 4\Car.csv")
dataset

<>:1: SyntaxWarning: invalid escape sequence '\D'
<>:1: SyntaxWarning: invalid escape sequence '\D'
C:\Users\aamir\AppData\Local\Temp\ipykernel_13828\1358886232.py:1: SyntaxWarning: invalid escape sequence '\D'
  dataset = pd.read_csv("E:\Data Science\session4\session 4\Car.csv")

    Age  Income  Car
0    28   37000    0
1    27   88000    0
2    28   59000    0
3    32   86000    0
4    33  149000    1
..  ...     ...  ...
95   28   89000    0
96   34   43000    0
97   30   79000    0
98   20   36000    0
99   26   80000    0

[100 rows x 3 columns]

In [9]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     100 non-null    int64
 1   Income  100 non-null    int64
 2   Car     100 non-null    int64
dtypes: int64(3)
memory usage: 2.5 KB

In [10]:
dataset.head()

   Age  Income  Car
0   28   37000    0
1   27   88000    0
2   28   59000    0
3   32   86000    0
4   33  149000    1

In [11]:
dataset.tail()

    Age  Income  Car
95   28   89000    0
96   34   43000    0
97   30   79000    0
98   20   36000    0
99   26   80000    0

In [12]:
dataset.Car.value_counts()

Car
0    93
1     7
Name: count, dtype: int64

In [13]:
dataset.rename(columns={"Car": "Target"})

    Age  Income  Target
0    28   37000       0
1    27   88000       0
2    28   59000       0
3    32   86000       0
4    33  149000       1
..  ...     ...     ...
95   28   89000       0
96   34   43000       0
97   30   79000       0
98   20   36000       0
99   26   80000       0

[100 rows x 3 columns]

In [14]:
dataset

    Age  Income  Car
0    28   37000    0
1    27   88000    0
2    28   59000    0
3    32   86000    0
4    33  149000    1
..  ...     ...  ...
95   28   89000    0
96   34   43000    0
97   30   79000    0
98   20   36000    0
99   26   80000    0

[100 rows x 3 columns]

In [15]:
dataset.rename(columns={"Car": "Target"}, inplace=True)
dataset

    Age  Income  Target
0    28   37000       0
1    27   88000       0
2    28   59000       0
3    32   86000       0
4    33  149000       1
..  ...     ...     ...
95   28   89000       0
96   34   43000       0
97   30   79000       0
98   20   36000       0
99   26   80000       0

[100 rows x 3 columns]

In [16]:
dataset.columns

Index(['Age', 'Income', 'Target'], dtype='object')

In [17]:
dataset[["Age", "Target"]]

    Age  Target
0    28       0
1    27       0
2    28       0
3    32       0
4    33       1
..  ...     ...
95   28       0
96   34       0
97   30       0
98   20       0
99   26       0

[100 rows x 2 columns]

In [19]:
dataset.loc[50]

Age          20
Income    74000
Target        0
Name: 50, dtype: int64

In [20]:
dataset.loc[50:60]

    Age  Income  Target
50   20   74000       0
51   26   15000       0
52   41   45000       0
53   31   76000       0
54   36   50000       0
55   40   47000       0
56   31   15000       0
57   46   59000       0
58   29   75000       0
59   26   30000       0
60   32  135000       1

In [21]:
dataset[(dataset["Income"] > 100000)]

    Age  Income  Target
4    33  149000       1
38   30  107000       1
60   32  135000       1
69   29  148000       1
72   34  115000       0
73   26  118000       0
83   32  117000       1

In [26]:
import pandas as pd


example = pd.read_csv("E://Data Science//session4//session 4//abc.csv")

example

  iteams  price
0      A   70.0
1      B    NaN
2      C   50.0
3      D    NaN
4      E   40.0
5      F   32.0
6      G   45.0
7      H   69.0
8      I    NaN
9      J    NaN

In [27]:
example["price"].notnull()

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8    False
9    False
Name: price, dtype: bool

In [28]:
example[example["price"].isnull()]

  iteams  price
1      B    NaN
3      D    NaN
8      I    NaN
9      J    NaN

In [29]:
example["price"].fillna(example["price"].max())

0    70.0
1    70.0
2    50.0
3    70.0
4    40.0
5    32.0
6    45.0
7    69.0
8    70.0
9    70.0
Name: price, dtype: float64

In [25]:
example['price'] = example['price'].fillna(example['price'].std())
example

  iteams      price
0      A  70.000000
1      B  15.517732
2      C  50.000000
3      D  15.517732
4      E  40.000000
5      F  32.000000
6      G  45.000000
7      H  69.000000
8      I  15.517732
9      J  15.517732

In [30]:
example["price"] = example["price"].fillna(example["price"].min())
example

  iteams  price
0      A   70.0
1      B   32.0
2      C   50.0
3      D   32.0
4      E   40.0
5      F   32.0
6      G   45.0
7      H   69.0
8      I   32.0
9      J   32.0

In [31]:
example["price"] = example["price"].fillna(example["price"].max())
example

  iteams  price
0      A   70.0
1      B   32.0
2      C   50.0
3      D   32.0
4      E   40.0
5      F   32.0
6      G   45.0
7      H   69.0
8      I   32.0
9      J   32.0

In [32]:
df.drop(["b"], axis="columns")

      a   c   d   e
0    89  66  15  79
1    94  91  46  23
2     4  16   3   5
3    18  68  97   7
4    27  61  76  90
..   ..  ..  ..  ..
995  13  69  57  74
996  15   8  75  20
997  54  76  66  47
998  94  54  44  98
999  41  29  12  33

[1000 rows x 4 columns]

In [33]:
df

      a   b   c   d   e
0    89  60  66  15  79
1    94  51  91  46  23
2     4  71  16   3   5
3    18  61  68  97   7
4    27  70  61  76  90
..   ..  ..  ..  ..  ..
995  13  11  69  57  74
996  15  64   8  75  20
997  54   7  76  66  47
998  94  66  54  44  98
999  41  62  29  12  33

[1000 rows x 5 columns]

In [34]:
df.drop(["b"], axis="columns", inplace=True)
df

      a   c   d   e
0    89  66  15  79
1    94  91  46  23
2     4  16   3   5
3    18  68  97   7
4    27  61  76  90
..   ..  ..  ..  ..
995  13  69  57  74
996  15   8  75  20
997  54  76  66  47
998  94  54  44  98
999  41  29  12  33

[1000 rows x 4 columns]

In [35]:
data1 = pd.DataFrame(
    data=np.random.randint(1, 100, size=(100, 4)), columns=list("abcd")
)

In [36]:
data2 = pd.DataFrame(data=np.random.randint(1, 100, size=(100, 3)), columns=list("xyz"))

In [37]:
data1

     a   b   c   d
0   60  83  69   7
1    6  17  75  21
2   86  74  70  10
3   44  71  12  79
4   36  94  40  11
..  ..  ..  ..  ..
95  75  85  67  10
96  53   2  64  69
97  86  22   5  41
98   9  40  83  33
99  24   3  31  40

[100 rows x 4 columns]

In [38]:
data2

     x   y   z
0   92  99  18
1   89  83  26
2    8  60  62
3   89  87  92
4   35  25   9
..  ..  ..  ..
95  97  23   9
96  11  95  66
97  63  43  82
98  82  98  74
99  55  54  35

[100 rows x 3 columns]

In [43]:
import pandas as pd

# Example DataFrames
data1 = pd.DataFrame({"A": [1, 2], "B": [3, 4]})
data2 = pd.DataFrame({"A": [5, 6], "B": [7, 8]})

# Correct way to append
data1 = pd.concat([data1, data2], ignore_index=True)
print(data1)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [ ]:
# data1.append(data2)  # ❌ This no longer works


# or same

import pandas as pd

# Example DataFrames
data1 = pd.DataFrame({"A": [1, 2], "B": [3, 4]})
data2 = pd.DataFrame({"A": [5, 6], "B": [7, 8]})

# Correct approach
data1 = pd.concat([data1, data2], ignore_index=True)  # ✅ Works in Pandas 2.0+
print(data1)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [40]:
data3 = pd.DataFrame(data=np.random.randint(1, 100, size=(100, 3)), columns=list("abc"))

In [41]:
data4 = pd.DataFrame(data=np.random.randint(1, 100, size=(100, 3)), columns=list("ayz"))

In [42]:
data3.merge(data4, on="a")

      a   b   c   y   z
0    85  72  72  92   5
1     9  79  62  54  64
2     9  86  98  54  64
3    30  68  45   3  12
4    30  68  45   1  78
..   ..  ..  ..  ..  ..
97   61  21  91  74  85
98   32  49  45  46  33
99   16  38  14  18  33
100  16  38  14  45  41
101  68  92  86  43  43

[102 rows x 5 columns]